IRP/src/Enums/PurchaseTransactionTypes/PurchaseTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PurchaseTransactionTypes</name>
 <enumValues>
  <name>Purchase</name>
 </enumValues>
 <enumValues>
  <name>ReceiptFromConsignor</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRevaluationCustomer</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRevaluationVendor</name>
 </enumValues>
 <enumValues>
  <name>PurchaisePreliminaryStock</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/PurchaseTransactionTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	
	IsPurchaseInvoice = False;
	
	If Parameters.Filter.Property("Ref") Then
		DocType = TypeOf(Parameters.Filter.Ref);
		IsPurchaseInvoice = (DocType = Type("DocumentRef.PurchaseInvoice"));
	EndIf;
	
	ChoiceData = New ValueList();
	ChoiceData.Add(Purchase);
	ChoiceData.Add(ReceiptFromConsignor);
	
	If FOServer.IsUseSimpleBatch() Then
		ChoiceData.Add(PurchaisePreliminaryStock);
	EndIf;
		
	If IsPurchaseInvoice Then
		ChoiceData.Add(CurrencyRevaluationCustomer);
		ChoiceData.Add(CurrencyRevaluationVendor);
	EndIf;
EndProcedure
